<?php
/*<p>16. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла
foreach и оператора if выведите на экран столбец элементов массива, 
как показано на картинке.
1, 2, 3
4, 5, 6
7, 8, 9</p>*/

	$arr = array(1, 2, 3, 4, 5, 6, 7, 8, 9);
	$i = 0;
	foreach($arr as $value){
			echo $value . ' ';
			$i++;
			if ($i == 3){
				echo "<br>";
			$i = 0;	
			}
		}
	$arr1 = array(1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6);
	$i = 0;
	foreach($arr1 as $value1) {
		echo $value1 . ' ';
		$i++;
		if($i == 4) {
			echo "<br>";
			$i = 0;
		}
	}